presentations/intro-to/learning-a-second-language.org
#+TITLE: Learning A Second Language
#+OPTIONS: toc:nil reveal_width:1200 reveal_height:1080 num:nil
#+REVEAL_ROOT: ../reveal.js
#+REVEAL_TITLE_SLIDE: <h1>%t</h1><h3>%s</h3><h2>By %A %a</h2><h3><i></i></h3><p>Press s for speaker notes</p>
#+REVEAL_THEME: black
#+REVEAL_TRANS: slide

#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper]
#+LATEX_HEADER: \usepackage[top=1cm,left=3cm,right=3cm]{geometry}


* How many people have used a language other than python in the within the last decade?
#+begin_notes
If your hand has gone up then I applaud you. You have passed the second barrier
that comes to programmers (the first being learning your first language). you have broken that barrier of locking your
programming thinking into the language you are using. If you have not we will
break that barrier today and hopefully you should be more equipped to walk out
into the world of programming languages and see them not a monolith but a medium
to have a conversation with your computer
#+end_notes

* so I presume that this code snippet will make little sense to people
#+begin_notes
so unless you are familiar with obscure academic languages then I will presume
that you can't read this code all that well

does anyone want to guess what this code does?

*give hints*
- well we can probably say that lst is a list and that function is a function
- we can probably presume that the last line calls the function function.

 other than that we will probably struggle to read more without some sort of indepth
  look at this languages semantics
#+end_notes

#+begin_src scheme
(define lst '(23 3 1 4 2 4 69 420) )

(define (function input)
  (cond
    ((or (null? input)
         (null? (cdr input)))
     input)
    (else
      (let ((pivot (car input))
            (rest (cdr input)))
        (append
          (function
            (filter (lambda (x) (< x pivot)) rest))
          (list pivot)
          (function
            (filter (lambda (x) (>= x pivot)) rest)))))))

(function lst)
#+end_src


#+ATTR_REVEAL: :frag (roll-in)
- Our Output:
 | 1 | 2 | 3 | 4 | 4 | 23 | 69 | 420 |
** the basic syntax
#+begin_notes
Now while syntax is important its is just a medium and you should know how to
use and exploit and once understood is the easiest part of learning a language
the syntax of scheme is very simple being comprised of 2 major forms in scheme.
atomic forms and s-expressions atomic forms are things like Numbers Strings
Symbols Booleans values and Characters.

s-expression's or symbolic expression's are a combinations of these atoms to form
larger structures. usually the first form after the first paren is the function
call then the next form is an argument to that function.

if you use a single quote before the start of a paren or before a symbol as
shown in the atom then it will be treated literally the first construct is how
we construct lists in scheme. the second is useful for passing around functions
and variables without having to resort to some weird string conversion hacks
#+end_notes
#+ATTR_REVEAl: :frag (roll-in)
- atoms
    #+begin_src scheme
    1 ; numbers
    "string"
    'sym ; symbols
    #t #f ;; booleans
    #\c ; harcters
    #+end_src

- s-exps
    #+begin_src scheme
    (some-function arg1 arg2 arg3...)
    (some-function '("a" "list" "of" "strings")) ; an example of a string list
    (some-function 'some-symbol)
    #+end_src

