presentations/intro-to/learning-a-second-language.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Learning A Second Language</title>
<meta name="author" content="Jeetaditya Chatterjee"/>
<link rel="stylesheet" href="../reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="../reveal.js/dist/theme/black.css" id="theme"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1>Learning A Second Language</h1><h3></h3><h2>By  Jeetaditya Chatterjee</h2><h3><i></i></h3><p>Press s for speaker notes</p>
</section>


<section>
<section id="slide-orgf7a44e6">
<h2 id="orgf7a44e6">How many people have used a language other than python in the within the last decade?</h2>
<aside class="notes">
<p>
If your hand has gone up then I applaud you. You have passed the second barrier
that comes to programmers (the first being learning your first language). you have broken that barrier of locking your
programming thinking into the language you are using. If you have not we will
break that barrier today and hopefully you should be more equipped to walk out
into the world of programming languages and see them not a monolith but a medium
to have a conversation with your computer
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org55741e4">
<h2 id="org55741e4">so I presume that this code snippet will make little sense to people</h2>
<aside class="notes">
<p>
so unless you are familiar with obscure academic languages then I will presume
that you can&rsquo;t read this code all that well
</p>

<p>
does anyone want to guess what this code does?
</p>

<p>
<b>give hints</b>
</p>
<ul>
<li>well we can probably say that lst is a list and that function is a function</li>
<li><p>
we can probably presume that the last line calls the function function.
</p>

<p>
other than that we will probably struggle to read more without some sort of indepth
 look at this languages semantics
</p></li>

</ul>

</aside>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #21bfc2;">(</span><span style="color: #b877db; font-style: italic;">define</span> <span style="color: #21bfc2;">lst</span> '<span style="color: #6c6f93;">(</span><span style="color: #f09383; font-weight: bold;">23</span> <span style="color: #f09383; font-weight: bold;">3</span> <span style="color: #f09383; font-weight: bold;">1</span> <span style="color: #f09383; font-weight: bold;">4</span> <span style="color: #f09383; font-weight: bold;">2</span> <span style="color: #f09383; font-weight: bold;">4</span> <span style="color: #f09383; font-weight: bold;">69</span> <span style="color: #f09383; font-weight: bold;">420</span><span style="color: #6c6f93;">)</span> <span style="color: #21bfc2;">)</span>

<span style="color: #21bfc2;">(</span><span style="color: #b877db; font-style: italic;">define</span> <span style="color: #6c6f93;">(</span><span style="color: #21bfc2;">function</span> input<span style="color: #6c6f93;">)</span>
  <span style="color: #6c6f93;">(</span><span style="color: #b877db; font-style: italic;">cond</span>
    <span style="color: #09f7a0;">(</span><span style="color: #b877db;">(</span><span style="color: #b877db; font-style: italic;">or</span> <span style="color: #21bfc2;">(</span>null? input<span style="color: #21bfc2;">)</span>
         <span style="color: #21bfc2;">(</span>null? <span style="color: #6c6f93;">(</span>cdr input<span style="color: #6c6f93;">)</span><span style="color: #21bfc2;">)</span><span style="color: #b877db;">)</span>
     input<span style="color: #09f7a0;">)</span>
    <span style="color: #09f7a0;">(</span><span style="color: #b877db; font-style: italic;">else</span>
      <span style="color: #b877db;">(</span><span style="color: #b877db; font-style: italic;">let</span> <span style="color: #21bfc2;">(</span><span style="color: #6c6f93;">(</span>pivot <span style="color: #09f7a0;">(</span>car input<span style="color: #09f7a0;">)</span><span style="color: #6c6f93;">)</span>
            <span style="color: #6c6f93;">(</span>rest <span style="color: #09f7a0;">(</span>cdr input<span style="color: #09f7a0;">)</span><span style="color: #6c6f93;">)</span><span style="color: #21bfc2;">)</span>
        <span style="color: #21bfc2;">(</span>append
          <span style="color: #6c6f93;">(</span>function
            <span style="color: #09f7a0;">(</span>filter <span style="color: #b877db;">(</span><span style="color: #b877db; font-style: italic;">lambda</span> <span style="color: #21bfc2;">(</span>x<span style="color: #21bfc2;">)</span> <span style="color: #21bfc2;">(</span>&lt; x pivot<span style="color: #21bfc2;">)</span><span style="color: #b877db;">)</span> rest<span style="color: #09f7a0;">)</span><span style="color: #6c6f93;">)</span>
          <span style="color: #6c6f93;">(</span>list pivot<span style="color: #6c6f93;">)</span>
          <span style="color: #6c6f93;">(</span>function
            <span style="color: #09f7a0;">(</span>filter <span style="color: #b877db;">(</span><span style="color: #b877db; font-style: italic;">lambda</span> <span style="color: #21bfc2;">(</span>x<span style="color: #21bfc2;">)</span> <span style="color: #21bfc2;">(</span>&gt;= x pivot<span style="color: #21bfc2;">)</span><span style="color: #b877db;">)</span> rest<span style="color: #09f7a0;">)</span><span style="color: #6c6f93;">)</span><span style="color: #21bfc2;">)</span><span style="color: #b877db;">)</span><span style="color: #09f7a0;">)</span><span style="color: #6c6f93;">)</span><span style="color: #21bfc2;">)</span>

<span style="color: #21bfc2;">(</span>function lst<span style="color: #21bfc2;">)</span>
</pre>
</div>


<ul>
<li class="fragment roll-in"><p>
Our Output:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">4</td>
<td class="org-right">23</td>
<td class="org-right">69</td>
<td class="org-right">420</td>
</tr>
</tbody>
</table></li>

</ul>
</section>
<section id="slide-org5ea7a4b">
<h3 id="org5ea7a4b">the basic syntax</h3>
<aside class="notes">
<p>
Now while syntax is important its is just a medium and you should know how to
use and exploit and once understood is the easiest part of learning a language
the syntax of scheme is very simple being comprised of 2 major forms in scheme.
atomic forms and s-expressions atomic forms are things like Numbers Strings
Symbols Booleans values and Characters.
</p>

<p>
s-expression&rsquo;s or symbolic expression&rsquo;s are a combinations of these atoms to form
larger structures. usually the first form after the first paren is the function
call then the next form is an argument to that function.
</p>

<p>
if you use a single quote before the start of a paren or before a symbol as
shown in the atom then it will be treated literally the first construct is how
we construct lists in scheme. the second is useful for passing around functions
and variables without having to resort to some weird string conversion hacks
</p>

</aside>
<ul>
<li class="fragment roll-in"><p>
atoms
</p>
<div class="org-src-container">

<pre class="src src-scheme">    <span style="color: #f09383; font-weight: bold;">1</span> <span style="color: #6c6f93; background-color: #292b36; font-style: italic;">; </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">numbers</span>
    <span style="color: #fab795;">"string"</span>
    'sym <span style="color: #6c6f93; background-color: #292b36; font-style: italic;">; </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">symbols</span>
    #t #f <span style="color: #6c6f93; background-color: #292b36; font-style: italic;">;; </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">booleans</span>
    #\c <span style="color: #6c6f93; background-color: #292b36; font-style: italic;">; </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">harcters</span>
</pre>
</div></li>

<li class="fragment roll-in"><p>
s-exps
</p>
<div class="org-src-container">

<pre class="src src-scheme">    <span style="color: #21bfc2;">(</span>some-function arg1 arg2 arg3...<span style="color: #21bfc2;">)</span>
    <span style="color: #21bfc2;">(</span>some-function '<span style="color: #6c6f93;">(</span><span style="color: #fab795;">"a"</span> <span style="color: #fab795;">"list"</span> <span style="color: #fab795;">"of"</span> <span style="color: #fab795;">"strings"</span><span style="color: #6c6f93;">)</span><span style="color: #21bfc2;">)</span> <span style="color: #6c6f93; background-color: #292b36; font-style: italic;">; </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">an example of a string list</span>
    <span style="color: #21bfc2;">(</span>some-function 'some-symbol<span style="color: #21bfc2;">)</span>
</pre>
</div></li>

</ul>

</section>
