presentations/intro-to/learning-a-second-language.org
** that weird define keyword
#+begin_notes
in python there is a keyword to define functions. def you then provide it with a
name and a set of arguments so on. variables are even simpler you just name it
and use the asignment operator (also known as =) to name a value.

but notice how we use the same keyword in a very similar way.
so lets have a look at what it does.
https://www.gnu.org/software/guile/manual/html_node/Definition.html *use website*

this explains variables but not the function.. or does it. a concept in lisp is
that functions are first class citizens this means we can pass them around like
any other value. scheme takes this further by making you define them in the same
way.

here all we are doing is binding the lambda or anonymous functions to the name
func. the syntax you saw before provides a nicer syntax to do the same thing

we actually have a similar thing in python with the ~lambda~ keyword
#+end_notes

#+ATTR_REVEAl: :frag (roll-in)
- the actual way to define functions
  #+begin_src scheme
(define func
  (lambda (x) (* x 2)))

(func 2)
  #+end_src

  : 4

- python lambdas
  #+begin_src python
func = lambda x: x * 2
return func(2)
  #+end_src

  : 4

#+reveal: split

#+begin_src scheme
(define lst '(23 3 1 4 2 4 69 420) )

(define (function input)
  (cond
    ((or (null? input)
         (null? (cdr input)))
     input)
    (else
      (let ((pivot (car input))
            (rest (cdr input)))
        (append
          (function
            (filter (lambda (x) (< x pivot)) rest))
          (list pivot)
          (function
            (filter (lambda (x) (>= x pivot)) rest)))))))

(function lst)
#+end_src
** Whats cond?
#+begin_notes
cond takes multiple tests and an associated action and performs the first action
which is true. its very similar to the if elif else tree but has much less
syntax asociated with it.

notice that last element. that else clause. it looks like any other symbol or
call. thats because for the most part it is. This meta programming aspect of
scheme is not something we will discuss today but if you are interested I would
recommend looking up scheme macros. in a word its a way of defining syntactic
structures like the ones we see here within the language itself
#+end_notes

#+begin_src python
x = 2
if x == 0:
    return "zero"
elif x == 1:
    return "one"
elif x == 2:
    return "two"
else:
    return "you do a lot of counting"
#+end_src

#+RESULTS:
: two

#+begin_src scheme
(define x 2)

(cond ((= x 0)
       "zero")
      ((= x 1)
       "one")
      ((= x 2)
       "two")
      (else ;; always evaluates to true
       "you do a lot of counting"))
#+end_src

#+RESULTS:
: two

#+reveal: split
#+begin_src scheme
(define lst '(23 3 1 4 2 4 69 420) )

(define (function input)
  (cond
    ((or (null? input)
         (null? (cdr input)))
     input)
    (else
      (let ((pivot (car input))
            (rest (cdr input)))
        (append
          (function
            (filter (lambda (x) (< x pivot)) rest))
          (list pivot)
          (function
            (filter (lambda (x) (>= x pivot)) rest)))))))

(function lst)
#+end_src
