presentations/intro-to/learning-a-second-language.html
<section id="slide-orgce8e68b">
<h3 id="orgce8e68b">that weird define keyword</h3>
<aside class="notes">
<p>
in python there is a keyword to define functions. def you then provide it with a
name and a set of arguments so on. variables are even simpler you just name it
and use the asignment operator (also known as =) to name a value.
</p>

<p>
but notice how we use the same keyword in a very similar way.
so lets have a look at what it does.
<a href="https://www.gnu.org/software/guile/manual/html_node/Definition.html">https://www.gnu.org/software/guile/manual/html_node/Definition.html</a> <b>use website</b>
</p>

<p>
this explains variables but not the function.. or does it. a concept in lisp is
that functions are first class citizens this means we can pass them around like
any other value. scheme takes this further by making you define them in the same
way.
</p>

<p>
here all we are doing is binding the lambda or anonymous functions to the name
func. the syntax you saw before provides a nicer syntax to do the same thing
</p>

<p>
we actually have a similar thing in python with the <code>lambda</code> keyword
</p>

</aside>

<ul>
<li class="fragment roll-in"><p>
the actual way to define functions
</p>
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #21bfc2;">(</span><span style="color: #b877db; font-style: italic;">define</span> <span style="color: #21bfc2;">func</span>
  <span style="color: #6c6f93;">(</span><span style="color: #b877db; font-style: italic;">lambda</span> <span style="color: #09f7a0;">(</span>x<span style="color: #09f7a0;">)</span> <span style="color: #09f7a0;">(</span>* x <span style="color: #f09383; font-weight: bold;">2</span><span style="color: #09f7a0;">)</span><span style="color: #6c6f93;">)</span><span style="color: #21bfc2;">)</span>

<span style="color: #21bfc2;">(</span>func <span style="color: #f09383; font-weight: bold;">2</span><span style="color: #21bfc2;">)</span>
</pre>
</div>

<pre class="example">
4
</pre></li>

<li class="fragment roll-in"><p>
python lambdas
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #e95678;">func</span> = <span style="color: #b877db; font-style: italic;">lambda</span> x: x * <span style="color: #f09383; font-weight: bold;">2</span>
<span style="color: #b877db; font-style: italic;">return</span> func(<span style="color: #f09383; font-weight: bold;">2</span>)
</pre>
</div>

<pre class="example">
4
</pre></li>

</ul>

</section>
<section>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #21bfc2;">(</span><span style="color: #b877db; font-style: italic;">define</span> <span style="color: #21bfc2;">lst</span> '<span style="color: #6c6f93;">(</span><span style="color: #f09383; font-weight: bold;">23</span> <span style="color: #f09383; font-weight: bold;">3</span> <span style="color: #f09383; font-weight: bold;">1</span> <span style="color: #f09383; font-weight: bold;">4</span> <span style="color: #f09383; font-weight: bold;">2</span> <span style="color: #f09383; font-weight: bold;">4</span> <span style="color: #f09383; font-weight: bold;">69</span> <span style="color: #f09383; font-weight: bold;">420</span><span style="color: #6c6f93;">)</span> <span style="color: #21bfc2;">)</span>

<span style="color: #21bfc2;">(</span><span style="color: #b877db; font-style: italic;">define</span> <span style="color: #6c6f93;">(</span><span style="color: #21bfc2;">function</span> input<span style="color: #6c6f93;">)</span>
  <span style="color: #6c6f93;">(</span><span style="color: #b877db; font-style: italic;">cond</span>
    <span style="color: #09f7a0;">(</span><span style="color: #b877db;">(</span><span style="color: #b877db; font-style: italic;">or</span> <span style="color: #21bfc2;">(</span>null? input<span style="color: #21bfc2;">)</span>
         <span style="color: #21bfc2;">(</span>null? <span style="color: #6c6f93;">(</span>cdr input<span style="color: #6c6f93;">)</span><span style="color: #21bfc2;">)</span><span style="color: #b877db;">)</span>
     input<span style="color: #09f7a0;">)</span>
    <span style="color: #09f7a0;">(</span><span style="color: #b877db; font-style: italic;">else</span>
      <span style="color: #b877db;">(</span><span style="color: #b877db; font-style: italic;">let</span> <span style="color: #21bfc2;">(</span><span style="color: #6c6f93;">(</span>pivot <span style="color: #09f7a0;">(</span>car input<span style="color: #09f7a0;">)</span><span style="color: #6c6f93;">)</span>
            <span style="color: #6c6f93;">(</span>rest <span style="color: #09f7a0;">(</span>cdr input<span style="color: #09f7a0;">)</span><span style="color: #6c6f93;">)</span><span style="color: #21bfc2;">)</span>
        <span style="color: #21bfc2;">(</span>append
          <span style="color: #6c6f93;">(</span>function
            <span style="color: #09f7a0;">(</span>filter <span style="color: #b877db;">(</span><span style="color: #b877db; font-style: italic;">lambda</span> <span style="color: #21bfc2;">(</span>x<span style="color: #21bfc2;">)</span> <span style="color: #21bfc2;">(</span>&lt; x pivot<span style="color: #21bfc2;">)</span><span style="color: #b877db;">)</span> rest<span style="color: #09f7a0;">)</span><span style="color: #6c6f93;">)</span>
          <span style="color: #6c6f93;">(</span>list pivot<span style="color: #6c6f93;">)</span>
          <span style="color: #6c6f93;">(</span>function
            <span style="color: #09f7a0;">(</span>filter <span style="color: #b877db;">(</span><span style="color: #b877db; font-style: italic;">lambda</span> <span style="color: #21bfc2;">(</span>x<span style="color: #21bfc2;">)</span> <span style="color: #21bfc2;">(</span>&gt;= x pivot<span style="color: #21bfc2;">)</span><span style="color: #b877db;">)</span> rest<span style="color: #09f7a0;">)</span><span style="color: #6c6f93;">)</span><span style="color: #21bfc2;">)</span><span style="color: #b877db;">)</span><span style="color: #09f7a0;">)</span><span style="color: #6c6f93;">)</span><span style="color: #21bfc2;">)</span>

<span style="color: #21bfc2;">(</span>function lst<span style="color: #21bfc2;">)</span>
</pre>
</div>
</section>
<section id="slide-org8b9a96a">
<h3 id="org8b9a96a">Whats cond?</h3>
<aside class="notes">
<p>
cond takes multiple tests and an associated action and performs the first action
which is true. its very similar to the if elif else tree but has much less
syntax asociated with it.
</p>

<p>
notice that last element. that else clause. it looks like any other symbol or
call. thats because for the most part it is. This meta programming aspect of
scheme is not something we will discuss today but if you are interested I would
recommend looking up scheme macros. in a word its a way of defining syntactic
structures like the ones we see here within the language itself
</p>

</aside>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #e95678;">x</span> = <span style="color: #f09383; font-weight: bold;">2</span>
<span style="color: #b877db; font-style: italic;">if</span> x == <span style="color: #f09383; font-weight: bold;">0</span>:
    <span style="color: #b877db; font-style: italic;">return</span> <span style="color: #fab795;">"zero"</span>
<span style="color: #b877db; font-style: italic;">elif</span> x == <span style="color: #f09383; font-weight: bold;">1</span>:
    <span style="color: #b877db; font-style: italic;">return</span> <span style="color: #fab795;">"one"</span>
<span style="color: #b877db; font-style: italic;">elif</span> x == <span style="color: #f09383; font-weight: bold;">2</span>:
    <span style="color: #b877db; font-style: italic;">return</span> <span style="color: #fab795;">"two"</span>
<span style="color: #b877db; font-style: italic;">else</span>:
    <span style="color: #b877db; font-style: italic;">return</span> <span style="color: #fab795;">"you do a lot of counting"</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #21bfc2;">(</span><span style="color: #b877db; font-style: italic;">define</span> <span style="color: #21bfc2;">x</span> <span style="color: #f09383; font-weight: bold;">2</span><span style="color: #21bfc2;">)</span>

<span style="color: #21bfc2;">(</span><span style="color: #b877db; font-style: italic;">cond</span> <span style="color: #6c6f93;">(</span><span style="color: #09f7a0;">(</span>= x <span style="color: #f09383; font-weight: bold;">0</span><span style="color: #09f7a0;">)</span>
       <span style="color: #fab795;">"zero"</span><span style="color: #6c6f93;">)</span>
      <span style="color: #6c6f93;">(</span><span style="color: #09f7a0;">(</span>= x <span style="color: #f09383; font-weight: bold;">1</span><span style="color: #09f7a0;">)</span>
       <span style="color: #fab795;">"one"</span><span style="color: #6c6f93;">)</span>
      <span style="color: #6c6f93;">(</span><span style="color: #09f7a0;">(</span>= x <span style="color: #f09383; font-weight: bold;">2</span><span style="color: #09f7a0;">)</span>
       <span style="color: #fab795;">"two"</span><span style="color: #6c6f93;">)</span>
      <span style="color: #6c6f93;">(</span><span style="color: #b877db; font-style: italic;">else</span> <span style="color: #6c6f93; background-color: #292b36; font-style: italic;">;; </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">always evaluates to true</span>
       <span style="color: #fab795;">"you do a lot of counting"</span><span style="color: #6c6f93;">)</span><span style="color: #21bfc2;">)</span>
</pre>
</div>

</section>
